Repository: common-repository/woocommerce-phone-order-gateway
Catalog: lang/woocommerce_phone_order-*.po
Languages: he_il

source: Phone Order
he_il: הזמנה טלפונית

source: Have your customers pay over the phone
he_il: אפשרו ללקוחות שלכם לשלם טלפונית

source: Enable Phone Order
he_il: הפעלת תשלום טלפוני

source: Enable the Phone Order gateway in WooCommerce
he_il: הפעלת תשלום טלפוני עבור WooCommerce

source: Title
he_il: כותרת

source: Payment method description that the customer will see on your checkout.
he_il: תיאור אפשרות התשלום שתוצג ללקוח בהזמנה שלכם.

source: Description
he_il: תיאור

source: Payment method description that the customer will see on your website.
he_il: תיאור אפשרות התשלום שתוצג ללקוח באתר שלכם.

source: Pay the order over the phone
he_il: תשלום ההזמנה דרך הטלפון

source: Instructions
he_il: הוראות

source: Instructions that will be added to the thank you page.
he_il: הוראות אשר יתווספו לדף התודה.

source: We have received the order and we will contact you shortly
he_il: קיבלנו את ההזמנה וניצור עימך קשר בהקדם האפשרי

source: Enable for shipping methods
he_il: אפשור עבור דרכי השילוח הבאות

source: If phone order is only available for certain methods, set it up here. Leave blank to enable for all methods.
he_il: במידה ותשלום טלפוני זמין רק עבור סוגי שילוח מסויימים הגדירו אותם כאן. אחרת השאירו שדה זה ריק בכדי לאפשר עבור כל סוגי השילוח.

source: Select shipping methods
he_il: בחירת אפשרויות משלוח

source: Payment to be made over the phone.
he_il: אפשרו ללקוחות שלכם לשלם טלפונית
